import { ReviewsGrid } from '../../../components/ReviewsGrid';
import ReviewAlexImg from '../assets/alexhohlov-photo.png';
import ReviewVeronicaImg from '../assets/veronica-photo.png';

const REVIEWS = [
  {
    id: 'vitaliy-1',
    title: 'Классное чувство!',
    text: 'После общения и полученных вводных от вас хочется творить, причем самому, без лишней помощи. Раньше я думал, как найти партнёров, искал тех, кто помог бы с разработкой приложения, а сейчас интересно всё сделать самому, я чувствую себя дирижером, а курсор - мой оркестр 🙌 Классное чувство!',
    author: 'Виталий',
    role: 'предприниматель, экс Альфа-Капитал',
    rating: 5 as const,
  },
  {
    id: 'alexander-khokhlov-1',
    title: 'Очень экономит время',
    text: 'Мне вчера друг-айтишник написал: "Ты понимаешь, что сделал работу, которую мы могли 4-5 месяцев делать?"',
    author: 'Александр Хохлов',
    role: '',
    rating: 5 as const,
    avatarUrl: ReviewAlexImg,
  },
  {
    id: 'veronika-efremova-1',
    title: 'Нетворкинг',
    text: 'Самое ценное для меня — возможность в любой момент задать вопрос в чате, обсудить кейс по работе с другими участниками или напрямую со спикерами. Эта поддержка и живое общение действительно много значат.',
    author: 'Вероника Ефремова',
    role: 'Head of Marketing Operations',
    rating: 5 as const,
    avatarUrl: ReviewVeronicaImg,
  },
];

export const ReviewsSection = () => (
  <div id="reviews">
    <h2 className="text-3xl md:text-4xl lg:text-[42px] xl:text-[48px] font-semibold text-black leading-[1.2] tracking-[-0.03em] mt-20 xl:mt-37 mb-8 lg:mb-12">
      Что говорят участники
    </h2>
    <ReviewsGrid
      reviews={REVIEWS}
      title=""
      initialRows={2}
      accentColor="#005EE0"
      showAllReviewsLink={false}
    />
  </div>
);
